#==============================================================================
# ■ Arrow_Base
#------------------------------------------------------------------------------
# 在戰鬥畫面使用的箭頭游標的活動區塊。
# 本類別作為 Arrow_Enemy 類別與 Arrow_Actor 類別的總綱來使用。
#==============================================================================

class Arrow_Base < Sprite
  #--------------------------------------------------------------------------
  # ● 定義實例變量
  #--------------------------------------------------------------------------
  attr_reader   :index                    # 游標位置
  attr_reader   :help_window              # 提示視窗
  #--------------------------------------------------------------------------
  # ● 初始化目標
  #     viewport : 顯示視口
  #--------------------------------------------------------------------------
  def initialize(viewport)
    super(viewport)
    self.bitmap = RPG::Cache.windowskin($game_system.windowskin_name)
    self.ox = 16
    self.oy = 64
    self.z = 2500
    @blink_count = 0
    @index = 0
    @help_window = nil
    update
  end
  #--------------------------------------------------------------------------
  # ● 設定游標位置
  #     index : 新的游標位置
  #--------------------------------------------------------------------------
  def index=(index)
    @index = index
    update
  end
  #--------------------------------------------------------------------------
  # ● 設定提示視窗
  #     help_window : 新的提示視窗
  #--------------------------------------------------------------------------
  def help_window=(help_window)
    @help_window = help_window
    # 更新提示內容 (update_help 由總綱定義)
    if @help_window != nil
      update_help
    end
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面
  #--------------------------------------------------------------------------
  def update
    # 更新閃爍時數
    @blink_count = (@blink_count + 1) % 8
    # 設定傳送源矩形
    if @blink_count < 4
      self.src_rect.set(128, 96, 32, 32)
    else
      self.src_rect.set(160, 96, 32, 32)
    end
    # 更新提示內容 (update_help 由總綱定義)
    if @help_window != nil
      update_help
    end
  end
end
